### Terraform Plan Results:
```
random_id.bucket_id: Refreshing state... [id=DLnwNg]
data.aws_ami.amazon_linux_2: Reading...
aws_vpc.main: Refreshing state... [id=vpc-05ed0a2afe2724e13]
aws_s3_bucket.kafka_bucket: Refreshing state... [id=kafka-bucket-0cb9f036]
data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0c104f6f4a5d9d1d5]
aws_internet_gateway.igw: Refreshing state... [id=igw-07e5400c533247667]
aws_subnet.public: Refreshing state... [id=subnet-064b2fa8425e5b9b6]
aws_security_group.allow_customip: Refreshing state... [id=sg-09a39cb2cb394d094]
aws_route_table.public: Refreshing state... [id=rtb-0d15564cb3b378d48]
aws_s3_bucket_public_access_block.bucket_block: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_instance.jenkins-runner: Refreshing state... [id=i-09618af6a96474ccc]
aws_instance.web: Refreshing state... [id=i-00db76b7c6743caa9]
aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-08b3f4848f6a8e104]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.web has changed
  ~ resource "aws_instance" "web" {
        id                                   = "i-00db76b7c6743caa9"
      ~ public_ip                            = "98.83.163.45" -> "3.85.217.95"
        tags                                 = {
            "Name" = "web-instance"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.jenkins-runner will be updated in-place
  ~ resource "aws_instance" "jenkins-runner" {
        id                                   = "i-09618af6a96474ccc"
      ~ public_dns                           = "ec2-18-232-142-192.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.232.142.192" -> (known after apply)
        tags                                 = {
            "Name" = "jenkins-runner"
        }
      ~ user_data                            = "ecddd081732a4a66b662333a22b932c50f20ac4c" -> "e164c5d249e78b05dbc660afad6bbfcf27f4de42"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # aws_security_group.allow_customip will be updated in-place
  ~ resource "aws_security_group" "allow_customip" {
        id                     = "sg-09a39cb2cb394d094"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "188.122.20.76/32",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "allow-customip-sg"
        tags                   = {
            "Name" = "allow-customip-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_public_ip = "98.83.163.45" -> "3.85.217.95"

Warning: Argument is deprecated

  with aws_s3_bucket.kafka_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "kafka_bucket":
   5: resource "aws_s3_bucket" "kafka_bucket" {

Use the aws_s3_bucket_versioning resource instead

(and 6 more similar warnings elsewhere)

â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```